[
    {
        "date": "Present",
        "title": "Served on the Program Committees of The International Conference On Optical and Terahertz Communications and Future Networks 2025. https://otcn.cc/committees.html"
    },
    {
        "date": "Present",
        "title": "Served on the International Committee for the 5th International Conference on Advanced Optics & Photonics Research in Engineering (AOPR 2025). https://www.aopr-conf.com/page/committee"
    },
    {
        "date": "May 14-16, 2025.",
        "title": "Served on the International Programme Committee for the 8th International Conference on Optics, Photonics, and Lasers (OPAL'19), reviewing conference submissions."
    },
    {
        "date": "August 26-29, 2024.",
        "title": "Participant of the Sixth Training Workshop for the Accreditation Council for Educational Programs in Physics (CAPEF), held at the Center for Research in Mathematics (CIMAT) in Guanajuato, México."
    },
    {
        "date": "July 1-2, 2024.",
        "title": "Served on the committee responsible for the external evaluation of the physics module in the EXANI-II CENEVAL national entrance examination, used for admissions to undergraduate programs at public Mexican institutes."
    },
    {
        "date": "July 20-22, 2024.",
        "title": "Served on the Technical Program Committee for the 3rd International Conference on Advanced Optics & Photonics Research in Engineering. https://www.aopr-conf.com/page/committee"
    },
    {
        "date": "April 19, 2024.",
        "title": "Member of the Academic Committee for the external evaluation of the mathematical module in the National Postgraduate Enrollment Exam (EXANI III), administered by the National Evaluation Center for Higher Education (CENEVAL). This exam is comparable to the GRE in the USA."
    },
    {
        "date": "February 10, 2024.",
        "title": "Committee Member and Mentor for students participating in the Hult Prize competition at UnADM."
    },
    {
        "date": "September 10, 2023- December",
        "title": "Served on the Scientific and Reading Committee for Hybrides, an international, transdisciplinary biannual journal of Arts, Letters, and"
    },
    {
        "date": "August 4-6, 2023.",
        "title": "Member of the Academic Committee for the external evaluation of the physics module in the national entrance examination EXANI-II CENEVAL, used for admissions to undergraduate programs at public Mexican institutes."
    },
    {
        "date": "September 27- October 2, 2019.",
        "title": "Local Co-organizer of the 2019 LAOP WORKSHOP, at Cancún, México. https://opticsphotonicswor.wixsite.com/workshop2019"
    },
    {
        "date": "October 25-29, 2010.",
        "title": "Junior staff at LII National Physics Congress. At Veracruz, México."
    }
]
