[
    {
        "date": "October 10, 2025-Present.",
        "title": "Winner of a national startup competition in Mexico for creating the first Latin American quantum composer (Qcomposer) — an educational platform designed to make quantum computing training more accessible. We’re now working on securing university accreditation so the program can count toward academic credits and be officially adopted by multiple universities and tech institutes across Mexico."
    },
    {
        "date": "June 12, 2024-Present.",
        "title": "CCyTEM Statal Researcher Level 1, Cuernavaca, Morelos, Mexico."
    },
    {
        "date": "October 28, 2022-Present.",
        "title": "CONACYT National Researcher Level 1 in Mexico's National System of Researchers, SNI."
    },
    {
        "date": "January 1, 2021-September 2023.",
        "title": "Postdoctoral Fellowship. Awarded by The National Council of Science and Technology (CONACyT)."
    },
    {
        "date": "October 30, 2020 - May 30, 2021.",
        "title": "Invited collaborator and participant in the Quantum Computing and Qiskit course offered by the University of Notre Dame Computing Research Department, USA."
    },
    {
        "date": "February 28, 2020 – February 28, 2023.",
        "title": "Expenses Research Grant to collaborate with the nanoHUB group. Awarded by the Center for Research Computing (CRC) at the University of Notre Dame and the Discovery Partners Institute at the University of Illinois Chicago, USA."
    },
    {
        "date": "January 18– February 28, 2020.",
        "title": "Travel &amp; Expenses Research Grant to collaborate with the nanoHUB group. Awarded by NDnano center, USA."
    },
    {
        "date": "September 1, 2013- August 31, 2019",
        "title": "CONACyT Scholarship for full PhD and MSc studies."
    },
    {
        "date": "May 1, 2018 - April 30, 2019.",
        "title": "CONACyT Internship Scholarship to the USA. June 4-August 26, 2011. Undergraduate Research Internship program at the Center for Scientific Research and Higher Education of Ensenada (CICESE), optics department. Awarded by The Mexican Academy of Sciences (AMC), México."
    },
    {
        "date": "June 4-August 26, 2011.",
        "title": "Undergraduate Research Internship program at the Center for Scientific Research and Higher Education of Ensenada (CICESE), optics department. Awarded by The Mexican Academy of Sciences (AMC), México."
    }
]
