[
    {
        "descirption": "Supervised master's degree thesis. Expected graduation in the summer of 2026.",
        "title": "Jose Marcelo Frias Castro (Co-supervised with Dr. Roberto Alán Beltrán Vargas), “Analysis of Deep Learning Techniques for Implementation in the Inpainting Problem in Facial Sketches”. CIICAp-UAEM, Cuernavaca, México.",
    },
    {
        "descirption": "Supervised master's degree thesis. Expected graduation in the summer of 2026.",
        "title": "Luis Arturo Tapia Alarcon “Design of Intelligent Sensors for the Detection and Prediction of Arsenic, Fluoride, Nitrate, and Salinity in Water: A Conceptual Approach Based on Machine Learning and Neural Networks”. CIICAp-UAEM, Cuernavaca, México."
    },
    {
        "descirption": "Supervised bachelor's degree thesis. Graduated on March 19th, 2025.",
        "title": "Gilberto Sebastian Fahara-Ojeda (Co-supervised with Dr. Jose Javier Sanchez Mondragon), “Bloch Oscillations in Zigzag Non-Hermitian Waveguides”. CIICAp-UAEM, Cuernavaca, México. This work has earned the student the Macke Foundation scholarship for his master's studies at Johannes Kepler University Linz, and winner of the Optics and Photonics Education Scholarship 2025 (2025 SPIE scholarship) https: //spie.org/members/student-hub/scholarships/optics-and-photonics-education-scholarships/current-winners"
    },
    {
        "descirption": "Supervised master's degree thesis. Graduated on October 17th, 2024.",
        "title": "Wilmer Contreras Sepulveda (Co-supervised with Dr. Jose Javier Sanchez Mondragon), “A quantum computing exploration”. Optics Department, INAOE, Puebla, Mexico. Winner of Optics and photonics education scholarship (2023 SPIE scholarship) 2024. https: //spie.org/documents/Membership/Scholarships/2023%20Scholarship%20PRs/Wilmer_Contreras_PR23_Final.pdf"
    },
    {
        "descirption": "Supervised master's degree thesis. Graduated on November 25th, 2022.",
        "title": "Miguel Arturo Espiricueta Ulloa (Co-supervised with Dr. Néstor Lozano Crisóstomo and Dr. Julio César García Melgarejo), \"Temperature sensing based on light polarization measurement in a nonlinear polarization-maintaining fiber\"Graduate Program on Mechanical Engineering, Torreón, Coahuila, México."
    }
]
