[
    {
        "date": "August 16- December 13, 2024.",
        "title": "Undergraduate course \"Complex analysis\" to Physics and Engineering students at CIICAp."
    },
    {
        "date": "August 16- December 13, 2024.",
        "title": "Undergraduate course \"Integral Transforms\" to Physics and Engineering students at CIICAp."
    },
    {
        "date": "August 16- December 13, 2024.",
        "title": "Undergraduate course 'Introduction to Quantum Computing' to Physics and Engineering students at CIICAp."
    },
    {
        "date": "January 29- June 7, 2024.",
        "title": "Undergraduate course 'Introduction to Quantum Computing' to Physics and Engineering students at CIICAp."
    },
    {
        "date": "January 29- June 7, 2024.",
        "title": "Undergraduate course \"Vector Calculus\" to Physics and Engineering students at CIICAp."
    },
    {
        "date": "January 29- June 7, 2024.",
        "title": "Undergraduate course \"Quantum Mechanics II\" to Physics students at CIICAp."
    },
    {
        "date": "January 29- June 7, 2024.",
        "title": "Undergraduate course \"Quantum Optics\" to Physics students at CIICAp."
    },
    {
        "date": "October 12- December 15, 2023.",
        "title": "Undergraduate course \"Integral Transforms\" to Physics and Engineering students at CIICAp."
    },
    {
        "date": "October 12- December 15, 2023.",
        "title": "Undergraduate course \"Quantum Mechanics\" on an introductory level to undergraduate students in the electronic engineering and applied physics program at CIICAp."
    },
    {
        "date": "October 12- December 15, 2023.",
        "title": "Undergraduate course 'Introduction to Quantum Computing' to Physics and Engineering students at CIICAp."
    },
    {
        "date": "May-June 2022.",
        "title": "Lecturer in charge, in collaboration with Dr. Francisco Soto Eguibar, of the Electromagnetic Theory courses for the propaedeutic master's program at INAOE, Puebla, México."
    },
    {
        "date": "February 28- July 3, 2020.",
        "title": "Professor of the Industrial Engineering Department. Universidad Técnica Superior de Xalapa, México. Courses: Algebra, Thermofluids, Electromagnetism, and Physics. Hybrid mode teaching online and in face-to-face classes."
    },
    {
        "date": "August 20- December 15, 2011.",
        "title": "High School Math Teacher at Colegio Constitución de 1917, Xalapa, México."
    }
]
